
## Plan Result (dev)

[CI link](https://github.com/fumi-mura/infra_portfolio/actions/runs/14484063700)


### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 4 to add, 0 to change, 8 to destroy.</code></pre>

* Create
  * module.test_1_s3.aws_s3_bucket.this
  * module.test_1_s3.aws_s3_bucket_public_access_block.this
  * module.test_1_s3.aws_s3_bucket_server_side_encryption_configuration.this
  * module.test_1_s3.aws_s3_bucket_versioning.this
* Delete
  * module.test_3_s3.aws_s3_bucket.this
  * module.test_3_s3.aws_s3_bucket_public_access_block.this
  * module.test_3_s3.aws_s3_bucket_server_side_encryption_configuration.this
  * module.test_3_s3.aws_s3_bucket_versioning.this
  * module.test_s3.aws_s3_bucket.this
  * module.test_s3.aws_s3_bucket_public_access_block.this
  * module.test_s3.aws_s3_bucket_server_side_encryption_configuration.this
  * module.test_s3.aws_s3_bucket_versioning.this


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.test_1_s3.aws_s3_bucket.this will be created
  + resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "dev-fumis-pf-test-1-s3-bucket"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Name" = "dev-fumis-pf-test-1-s3-bucket"
        }
      + tags_all                    = {
          + "Environment"        = "dev"
          + "ManagedByTerraform" = "true"
          + "Name"               = "dev-fumis-pf-test-1-s3-bucket"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.test_1_s3.aws_s3_bucket_public_access_block.this will be created
  + resource "aws_s3_bucket_public_access_block" "this" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.test_1_s3.aws_s3_bucket_server_side_encryption_configuration.this will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "this" {
      + bucket = "dev-fumis-pf-test-1-s3-bucket"
      + id     = (known after apply)

      + rule {
          + apply_server_side_encryption_by_default {
              + sse_algorithm     = "AES256"
                # (1 unchanged attribute hidden)
            }
        }
    }

  # module.test_1_s3.aws_s3_bucket_versioning.this will be created
  + resource "aws_s3_bucket_versioning" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # module.test_3_s3.aws_s3_bucket.this will be destroyed
  # (because aws_s3_bucket.this is not in configuration)
  - resource "aws_s3_bucket" "this" {
      - arn                         = "arn:aws:s3:::dev-fumis-pf-test-3-s3-bucket" -> null
      - bucket                      = "dev-fumis-pf-test-3-s3-bucket" -> null
      - bucket_domain_name          = "dev-fumis-pf-test-3-s3-bucket.s3.amazonaws.com" -> null
      - bucket_regional_domain_name = "dev-fumis-pf-test-3-s3-bucket.s3.ap-northeast-1.amazonaws.com" -> null
      - force_destroy               = false -> null
      - hosted_zone_id              = "Z2M4EHUR26P7ZW" -> null
      - id                          = "dev-fumis-pf-test-3-s3-bucket" -> null
      - object_lock_enabled         = false -> null
      - region                      = "ap-northeast-1" -> null
      - request_payer               = "BucketOwner" -> null
      - tags                        = {
          - "Name" = "dev-fumis-pf-test-3-s3-bucket"
        } -> null
      - tags_all                    = {
          - "Environment"        = "dev"
          - "ManagedByTerraform" = "true"
          - "Name"               = "dev-fumis-pf-test-3-s3-bucket"
        } -> null
        # (3 unchanged attributes hidden)

      - grant {
          - id          = "42fcced65391ac0bb4329ab830771c90d186802007abc036498942ecc41aacf6" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
            # (1 unchanged attribute hidden)
        }

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm     = "AES256" -> null
                    # (1 unchanged attribute hidden)
                }
            }
        }

      - versioning {
          - enabled    = true -> null
          - mfa_delete = false -> null
        }
    }

  # module.test_3_s3.aws_s3_bucket_public_access_block.this will be destroyed
  # (because aws_s3_bucket_public_access_block.this is not in configuration)
  - resource "aws_s3_bucket_public_access_block" "this" {
      - block_public_acls       = true -> null
      - block_public_policy     = true -> null
      - bucket                  = "dev-fumis-pf-test-3-s3-bucket" -> null
      - id                      = "dev-fumis-pf-test-3-s3-bucket" -> null
      - ignore_public_acls      = true -> null
      - restrict_public_buckets = true -> null
    }

  # module.test_3_s3.aws_s3_bucket_server_side_encryption_configuration.this will be destroyed
  # (because aws_s3_bucket_server_side_encryption_configuration.this is not in configuration)
  - resource "aws_s3_bucket_server_side_encryption_configuration" "this" {
      - bucket                = "dev-fumis-pf-test-3-s3-bucket" -> null
      - id                    = "dev-fumis-pf-test-3-s3-bucket" -> null
        # (1 unchanged attribute hidden)

      - rule {
          - bucket_key_enabled = false -> null

          - apply_server_side_encryption_by_default {
              - sse_algorithm     = "AES256" -> null
                # (1 unchanged attribute hidden)
            }
        }
    }

  # module.test_3_s3.aws_s3_bucket_versioning.this will be destroyed
  # (because aws_s3_bucket_versioning.this is not in configuration)
  - resource "aws_s3_bucket_versioning" "this" {
      - bucket                = "dev-fumis-pf-test-3-s3-bucket" -> null
      - id                    = "dev-fumis-pf-test-3-s3-bucket" -> null
        # (1 unchanged attribute hidden)

      - versioning_configuration {
          - status     = "Enabled" -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.test_s3.aws_s3_bucket.this will be destroyed
  # (because aws_s3_bucket.this is not in configuration)
  - resource "aws_s3_bucket" "this" {
      - arn                         = "arn:aws:s3:::dev-fumis-pf-test-s3-bucket" -> null
      - bucket                      = "dev-fumis-pf-test-s3-bucket" -> null
      - bucket_domain_name          = "dev-fumis-pf-test-s3-bucket.s3.amazonaws.com" -> null
      - bucket_regional_domain_name = "dev-fumis-pf-test-s3-bucket.s3.ap-northeast-1.amazonaws.com" -> null
      - force_destroy               = false -> null
      - hosted_zone_id              = "Z2M4EHUR26P7ZW" -> null
      - id                          = "dev-fumis-pf-test-s3-bucket" -> null
      - object_lock_enabled         = false -> null
      - region                      = "ap-northeast-1" -> null
      - request_payer               = "BucketOwner" -> null
      - tags                        = {
          - "Name" = "dev-fumis-pf-test-s3-bucket"
        } -> null
      - tags_all                    = {
          - "Environment"        = "dev"
          - "ManagedByTerraform" = "true"
          - "Name"               = "dev-fumis-pf-test-s3-bucket"
        } -> null
        # (3 unchanged attributes hidden)

      - grant {
          - id          = "42fcced65391ac0bb4329ab830771c90d186802007abc036498942ecc41aacf6" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
            # (1 unchanged attribute hidden)
        }

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm     = "AES256" -> null
                    # (1 unchanged attribute hidden)
                }
            }
        }

      - versioning {
          - enabled    = true -> null
          - mfa_delete = false -> null
        }
    }

  # module.test_s3.aws_s3_bucket_public_access_block.this will be destroyed
  # (because aws_s3_bucket_public_access_block.this is not in configuration)
  - resource "aws_s3_bucket_public_access_block" "this" {
      - block_public_acls       = true -> null
      - block_public_policy     = true -> null
      - bucket                  = "dev-fumis-pf-test-s3-bucket" -> null
      - id                      = "dev-fumis-pf-test-s3-bucket" -> null
      - ignore_public_acls      = true -> null
      - restrict_public_buckets = true -> null
    }

  # module.test_s3.aws_s3_bucket_server_side_encryption_configuration.this will be destroyed
  # (because aws_s3_bucket_server_side_encryption_configuration.this is not in configuration)
  - resource "aws_s3_bucket_server_side_encryption_configuration" "this" {
      - bucket                = "dev-fumis-pf-test-s3-bucket" -> null
      - id                    = "dev-fumis-pf-test-s3-bucket" -> null
        # (1 unchanged attribute hidden)

      - rule {
          - bucket_key_enabled = false -> null

          - apply_server_side_encryption_by_default {
              - sse_algorithm     = "AES256" -> null
                # (1 unchanged attribute hidden)
            }
        }
    }

  # module.test_s3.aws_s3_bucket_versioning.this will be destroyed
  # (because aws_s3_bucket_versioning.this is not in configuration)
  - resource "aws_s3_bucket_versioning" "this" {
      - bucket                = "dev-fumis-pf-test-s3-bucket" -> null
      - id                    = "dev-fumis-pf-test-s3-bucket" -> null
        # (1 unchanged attribute hidden)

      - versioning_configuration {
          - status     = "Enabled" -> null
            # (1 unchanged attribute hidden)
        }
    }

Plan: 4 to add, 0 to change, 8 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":30,"Program":"tfcmt","SHA1":"3557c00223ac411b0c645cfecb37ab3887c63cbb","Target":"dev","Vars":{},"WorkflowName":"Plan"} -->